#if !defined ___TECHTRAINING_CHAPTER4_LIST_MANUAL_TEST___
#define      ___TECHTRAINING_CHAPTER4_LIST_MANUAL_TEST___

//--------------------------------------------------------------------------------
// ファイル依存関係
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
// マクロ定義
//--------------------------------------------------------------------------------
// コンパイル関連手動テスト(リスト)

// ※コンパイルが通らなければ成功
//#define TT_TEST_SORT_BY_FRAUD_KEY

// ※コンパイルが通らなければ成功
//#define TT_TEST_SORT_IS_CONST



#endif // ___TECHTRAINING_CHAPTER4_LIST_MANUAL_TEST___